In [1]:
import pandas as pd
import numpy as np

In [2]:
a = [1,2,3,4,5,6,7,'nikhil','hero']
print(a)
print(type(a))

[1, 2, 3, 4, 5, 6, 7, 'nikhil', 'hero']
<class 'list'>

In [3]:
a = np.array([1,2,3,4,5,6,7,'nikhil','hero'])
print(a)
print(type(a))

['1' '2' '3' '4' '5' '6' '7' 'nikhil' 'hero']
<class 'numpy.ndarray'>

## Pandas Series

In [4]:
a = pd.Series([1,2,3,4,5,6,7,'nikhil','hero'])
print(a)
print(type(a))

0         1
1         2
2         3
3         4
4         5
5         6
6         7
7    nikhil
8      hero
dtype: object
<class 'pandas.core.series.Series'>

In [5]:
a = pd.Series([1,2,3,4,'nikhil','hero'],index=[
    'a','b','c','d','e','f'
])
print(a)
print(type(a))

a         1
b         2
c         3
d         4
e    nikhil
f      hero
dtype: object
<class 'pandas.core.series.Series'>

In [6]:
a = pd.Series([1,2,3,4,5],index=[
    'a','b','c','d','e'
], dtype=float)
print(a)
print(type(a))

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
dtype: float64
<class 'pandas.core.series.Series'>

In [7]:
a = pd.Series([1,2,3,4,5],index=[
    'a','b','c','d','e'
], dtype=float, name='xyz')
print(a)
print(type(a))

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: xyz, dtype: float64
<class 'pandas.core.series.Series'>

In [8]:
a = pd.Series(index=[
    'a','b','c','d','e'
], name='xyz')
print(a)
print(type(a))

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
Name: xyz, dtype: float64
<class 'pandas.core.series.Series'>

In [9]:
a = pd.Series(5.2,index=[
    'a','b','c','d','e'
], name='xyz')
print(a)
print(type(a))

a    5.2
b    5.2
c    5.2
d    5.2
e    5.2
Name: xyz, dtype: float64
<class 'pandas.core.series.Series'>

In [10]:
s1 = pd.Series({'a':'ravi teja','b':'allu arjun','c':'mahesh babu','d':'chiranjeevi'})
s1

a      ravi teja
b     allu arjun
c    mahesh babu
d    chiranjeevi
dtype: object

## Indexing and Slicing

In [12]:
a = pd.Series([1,2,3,4,5],index=[
    'a','b','c','d','e'
], dtype=float, name='xyz')
print(a)
print(type(a))

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: xyz, dtype: float64
<class 'pandas.core.series.Series'>

In [31]:
print(a['d'])
print(a.e)

4.0
5.0

In [33]:
print(a['c':'f'])

c    3.0
d    4.0
e    5.0
Name: xyz, dtype: float64

In [37]:
print(a.max())
print(a.min())

5.0
1.0

In [49]:
s1 = pd.Series(dict([(i,v) for i,v in zip('abcdefgh',np.arange(1,9))]))
s2 = pd.Series(dict([(i,v) for i,v in zip('abcdefgh',np.arange(11,19))]))

In [51]:
s1

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [53]:
s2

a    11
b    12
c    13
d    14
e    15
f    16
g    17
h    18
dtype: int64

In [55]:
s1 + s2

a    12
b    14
c    16
d    18
e    20
f    22
g    24
h    26
dtype: int64

## DataFrame

In [67]:
d1 = pd.DataFrame([i for i in range(1,5)])
s1 = pd.Series([i for i in range(1,5)])
print('Series')
s1

Series

0    1
1    2
2    3
3    4
dtype: int64

In [69]:
print('DataFrame')
d1

DataFrame

   0
0  1
1  2
2  3
3  4

In [71]:
df = pd.DataFrame([[1,2,3,4,5,6],[3,2,1,4,5,6],[4,5,2,1,3,6],[1,2,4,5,6,3]])
df

   0  1  2  3  4  5
0  1  2  3  4  5  6
1  3  2  1  4  5  6
2  4  5  2  1  3  6
3  1  2  4  5  6  3

In [75]:
df = pd.DataFrame({'f1':[1,2,3,4,5,6],
                   'f2':[3,2,1,4,5,6],
                   'f3':[4,5,2,1,3,6],
                   'f4':[1,2,4,5,6,3]})
df

   f1  f2  f3  f4
0   1   3   4   1
1   2   2   5   2
2   3   1   2   4
3   4   4   1   5
4   5   5   3   6
5   6   6   6   3

In [77]:
df = pd.DataFrame([{'f1':[1,2,3,4,5,6],
                   'f2':[3,2,1,4,5,6],
                   'f3':[4,5,2,1,3,6],
                   'f4':[1,2,4,5,6,3]}])
df

,f1,f2,f3,f4
0,"[1, 2, 3, 4, 5, 6]","[3, 2, 1, 4, 5, 6]","[4, 5, 2, 1, 3, 6]","[1, 2, 4, 5, 6, 3]"

In [79]:
df = pd.DataFrame([[1,2,3,4,5,6],[3,2,1,4,5,6],[4,5,2,1,3,6],[1,2,4,5,6,3]], 
                  columns=['f1','f2','f3','f4','f5','f6'])
df

   f1  f2  f3  f4  f5  f6
0   1   2   3   4   5   6
1   3   2   1   4   5   6
2   4   5   2   1   3   6
3   1   2   4   5   6   3

In [95]:
## Exercise

fdf = pd.DataFrame(np.linspace(1,3,25, dtype=int).reshape(5,5), 
                   columns=[f'{v}{i}' for i,v in enumerate('fffff')])
fdf

   f0  f1  f2  f3  f4
0   1   1   1   1   1
1   1   1   1   1   1
2   1   1   2   2   2
3   2   2   2   2   2
4   2   2   2   2   3

In [99]:
fmat = pd.DataFrame({
    'id':[i for i in range(101,108)],
    'name':['ram','kapil','riya','megha','saket','aman','pranay'],
    'per':[45,67,89,34,56,78,99]
})
fmat

    id    name  per
0  101     ram   45
1  102   kapil   67
2  103    riya   89
3  104   megha   34
4  105   saket   56
5  106    aman   78
6  107  pranay   99

In [103]:
tv = pd.DataFrame({
    'Grade':['a+','b+','b+','a++','c','d','a++']
})
tv

  Grade
0    a+
1    b+
2    b+
3   a++
4     c
5     d
6   a++

## Methods to combine two data frames

In [105]:
pd.concat([fmat,tv],axis=1)

    id    name  per Grade
0  101     ram   45    a+
1  102   kapil   67    b+
2  103    riya   89    b+
3  104   megha   34   a++
4  105   saket   56     c
5  106    aman   78     d
6  107  pranay   99   a++

In [109]:
fmat['grade'] = tv
fmat

    id    name  per grade
0  101     ram   45    a+
1  102   kapil   67    b+
2  103    riya   89    b+
3  104   megha   34   a++
4  105   saket   56     c
5  106    aman   78     d
6  107  pranay   99   a++

In [111]:
fmat[5] = tv
fmat

    id    name  per grade    5
0  101     ram   45    a+   a+
1  102   kapil   67    b+   b+
2  103    riya   89    b+   b+
3  104   megha   34   a++  a++
4  105   saket   56     c    c
5  106    aman   78     d    d
6  107  pranay   99   a++  a++

In [114]:
fmat[4] = tv
fmat

    id    name  per grade    5    4
0  101     ram   45    a+   a+   a+
1  102   kapil   67    b+   b+   b+
2  103    riya   89    b+   b+   b+
3  104   megha   34   a++  a++  a++
4  105   saket   56     c    c    c
5  106    aman   78     d    d    d
6  107  pranay   99   a++  a++  a++